/**
 * author : bianlongting
 * email : 1137060420@qq.com
 * date : 2016-08-16 10:00
 * description : 协议
 */

import React , { Component } from 'react';
import styles from '../styles/protocolStyle';

export default class Protocol extends Component {
	render () {
		return (
			<div style = { styles.protocol } >
				<p style = { styles.title } >用户注册和服务协议</p>

				<p>欢迎您来到源品优购。请您仔细阅读本注册协议，您点击"已阅读并同意"按钮后，本协议即构成对双方有约束力的法律文件。如果您不同意本协议中的任何内容，则无权使用本平台及其相关服务。您的使用行为将视为对本协议的接受，并同意接受本协议各项条款的约束。 
				本协议约定源品优购与用户之间关于“源品优购”平台服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由源品优购随时更新，更新后的协议条款一旦公布即代替原来的协议条款，不再另行通知，用户可在官方平台查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请停止使用源品优购提供的服务，如果继续使用将被视为接受修改后的协议。

				在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读下面条款并选择接受或不接受本协议。</p>

				<p style = { styles.title } >一、账号注册</p>

				<p>1.用户在使用本服务前需要注册一个“源品优购”账号。“源品优购”账号应当以手机号注册，源品优购可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。</p>

				<p>2.在用户注册及使用本服务时，源品优购需要搜集能识别用户身份的个人信息以便可以在必要时联系用户，或为用户提供更好的使用体验。源品优购搜集的信息包括但不限于用户的姓名、地址；源品优购同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。</p>

				<p style = { styles.title }>二、用户个人隐私保护</p>

				<p>1.如果源品优购发现或收到他人举报或投诉用户违反本协议约定的，源品优购有权随时对相关内容进行审查，并视情节轻重对违规账号处以包括但不限于警告、账号封禁 、功能封禁 的处罚，且通知用户处理原因和结果。</p>

				<p>2.因违反用户协议被封禁的用户，可以自行与源品优购联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉。</p>

				<p>3.用户理解并同意，源品优购有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</p>

				<p style = { styles.title }>三、违规行为</p>

				<p style = { styles.title }>以下行为是不被源品优购允许的</p>

				<p>1.反对宪法所确定的基本原则的；</p>

				<p>2.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

				<p>3.损害国家荣誉和利益的；</p>

				<p>4.煽动民族仇恨、民族歧视，破坏民族团结的；</p>

				<p>5.侮辱或者诽谤他人，侵害他人合法权益的；</p>

				<p>6.利用技术手段批量建立虚假账号的；</p>

				<p>7.利用“源品优购”账号或本服务从事任何其他违法犯罪活动的；</p>

				<p>8.其他违反法律法规规定、侵犯其他用户合法权益、干扰“源品优购”正常运营或源品优购未明示授权的行为。</p>

				<p>9.未经授权擅自使用源品优购图片和商品信息</p>

				<p style = { styles.title }>四、合同订立</p>
				源品优购平台上展示的商品信息（如商品名称、价格、商品描述等）仅构成要约邀请，用户通过源品优购订购商品，订单即为购买商品的要约，只有当本公司向用户发出送货确认的信息通知用户本公司已将该商品发出，构成本公司对该订单的承诺，此时合同即告成立。

				<p>1. 当用户购买的商品经用户签收后，该商品的所有权和灭失风险即转移给用户。 </p>

				<p>2. 用户同意本公司有保留在发现源品优购平台上显示的商品信息错误或缺货的情况下，撤回或修改该等信息的权利，并保留对商品订购数量的限制权。用户下订单即表示其对在订单中提供的信息的真实性负责。</p>

				<p>3. 源品优购平台上显示的每一商品的价格都包含法律规定的税金，送货费用根据源品优购的配送政策和用户选择的送货方式另行计收。本公司有权更改上述有关价格信息和送货费用的政策，而不做另行通知。</p>

				<p style = { styles.title }>五、免责声明</p>

				<p>1.用户将照片、个人信息等资料上传到互联网上，有可能会被其他组织或个人复制、转载、擅改或做其它非法用途，用户必须充分意识此类风险的存在。用户明确同意其使用源品优购服务所存在的风险（包括但不限于受到第三方侵权或对第三方造成侵权）将完全由其自己承担；因其使用源品优购服务而产生的一切后果也由其自己承担，源品优购对此不承担任何责任。</p>

				<p>2.源品优购不担保本服务一定能满足用户的要求，也不担保本服务不会中断，对本服务的及时性、安全性、准确性、真实性、完整性也都不作担保。</p>

				<p>3.对于因不可抗力或源品优购不能控制的原因造成的本服务中断或其它缺陷，源品优购不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>

				<p>4.根据有关法律法规，源品优购在此郑重提醒用户注意，任何经由本服务以上传、张贴、发送电子邮件或任何其它方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息或其它资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。源品优购无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性或品质。在任何情况下，源品优购均不为任何内容负责，包含但不限于任何内容之任何错误或遗漏，以及经由本服务以张贴、发送电子邮件或其它方式传送任何内容而衍生之任何损失或损害。但源品优购有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。</p>

				<p>5.源品优购作为网络服务提供者，对非法转载，虚假发布、盗版行为的发生不具备充分的监控能力。源品优购对他人在网站上实施的此类侵权行为不承担法律责任，侵权的法律责任概由本人承担。</p>

				<p style = { styles.title }>六、其他补充</p>

				<p>1.本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和源品优购之间发生任何纠纷或争议，首先应友好协商解决，协商不成，用户同意将纠纷或争议提交源品优购所在地有管辖权的人民法院管辖。</p>

				<p>2.本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</p>

				<p style = { styles.title }>七、服务与帮助</p>

				<p>再次欢迎您使用源品优购。使用过程中遇到任何问题，欢迎拨打源品优购客户服务电话或者登录我们的客户端咨询，我们都愿意随时跟您联系帮您解决，感谢您的支持。</p>
				<p>在线客服：400-670-1118</p>

			</div>
		)
	}
}